## :x: Apply Result (main)

[CI link](https://github.com/Shion1305/Shion1305-infra/actions/runs/18894779213)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
oci_identity_compartment.main-compartment: Refreshing state... [id=ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq]
oci_core_vcn.main-vcn: Refreshing state... [id=ocid1.vcn.oc1.ap-tokyo-1.amaaaaaaqiqkkcyavaoppezgphkllmrizfar3ycecg7phwvws4ceipafbdra]
oci_kms_vault.main: Refreshing state... [id=ocid1.vault.oc1.ap-tokyo-1.eztwosspaafyo.abxhiljrc6p3slv4lvmnljlxljomxbe7opkyleyv4jictsq7zedidplooc3q]
oci_core_network_security_group.k8s-nsg: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-tokyo-1.aaaaaaaareo3ddfn7ljzuyyfungeuweyh2tdfn7b2ty3gvxqmx4ig5equobq]
oci_core_dhcp_options.main-dhcp-options: Refreshing state... [id=ocid1.dhcpoptions.oc1.ap-tokyo-1.aaaaaaaavdzkksyupctnoqbj2hpo6w63vxtgx227o7hv52kl4nru6bcjvfwa]
oci_core_network_security_group.main-nsg: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-tokyo-1.aaaaaaaavrvw7s2foai4nyakfvqq5e74pb2b4bsjwjnpnyrgw3y2narigk3a]
oci_core_internet_gateway.main-internet-gateway: Refreshing state... [id=ocid1.internetgateway.oc1.ap-tokyo-1.aaaaaaaaw3dtysi3sctisyiqic4jxduykrhke2eo6dafwrgoqqbpzgung6ma]
oci_core_security_list.permissive-security-list: Refreshing state... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaaaaax2e22ekjmabsofg5mjg5ab2ofn6f5h7ki2o55d33a5lnpjiil2pq]
oci_kms_key.main: Refreshing state... [id=ocid1.key.oc1.ap-tokyo-1.eztwosspaafyo.abxhiljrzskbcgfpswirx3i7sokmf2shh4iadjbgnausysbvrdi7zyjprymq]
oci_core_network_security_group_security_rule.main-nsg-egress-rule: Refreshing state... [id=F542E8]
oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-anywhere: Refreshing state... [id=BF7899]
oci_core_network_security_group_security_rule.main-nsg-ingress-4914: Refreshing state... [id=7A16CA]
oci_core_network_security_group_security_rule.main-nsg-ingress-6443: Refreshing state... [id=A329FB]
oci_core_network_security_group_security_rule.main-nsg-ingress-http: Refreshing state... [id=91FCC3]
oci_core_network_security_group_security_rule.main-nsg-ingress-https: Refreshing state... [id=0516DD]
oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-vcn: Refreshing state... [id=CE19EB]
oci_core_network_security_group_security_rule.main-nsg-ingress-ssh: Refreshing state... [id=CF2FDC]
oci_core_route_table.main-route-table: Refreshing state... [id=ocid1.routetable.oc1.ap-tokyo-1.aaaaaaaa5pv27xf72rg4p54tenysrpi7rzsvmu7laetwnikkmzdbevhmz4la]
oci_core_network_security_group_security_rule.k8s-nsg-ingress-rule: Refreshing state... [id=69ADF9]
oci_core_network_security_group_security_rule.k8s-nsg-egress-rule: Refreshing state... [id=E81293]
oci_core_subnet.main-subnet: Refreshing state... [id=ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaneghxjqpturxbnptzpcf44egzgd2gzg3el2oxyum2lj3ygczbkeq]
module.oci_compute_instance-k8s.oci_core_instance.this: Refreshing state... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycqrbpmpg5ljs6qo33hcfmcll3kbdoukpdbhtoeify2syq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.oci_compute_instance-k8s-proxy.oci_core_instance.this will be created
  + resource "oci_core_instance" "this" {
      + availability_domain                 = "kbTA:AP-TOKYO-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "oci_compute_instance-k8s-proxy"
      + extended_metadata                   = (known after apply)
      + fault_domain                        = "FAULT-DOMAIN-1"
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAAEAQDAR5lLWfcv3R351aosBQo/SDAN+VEXYrrxedgGBBJSwaYFKJ1/IX/+dXKUL+NPPL56MJtFSzLCBIsJj5dMzahGHvCtbo5JIpOPKGagHpAo4e7JvSFRUV1jMvW6TI6S09xch8cNNMK32tPVhptV9L9J63XZz3WnH9ApW7jZiBlboOzC2sYLBfcIMVW1a4Sp5CN0ACrjOv//xx4gNHX6QCYCF19xlAeosRSqGrI/av8pohOMCSF7XI6U60YaDsRLPNrzMEParcad7ZygVpMI1SmP39U+7aCbHZJF7rMpckJVKH7tjZsZXOjl0AGXQDURptHsPOg9tWDZpflzYZRDT9juYIZc86jtE38ySsBos4jPWkTuz8ltSkqyeDOyvjExj9dC4i0RT/rgLgKmOQwvQrTfJ4LdLFV846ThACW6c8CISazBorskju7xF1bAKTGfhm3duV90xiuPl+XZpaf3JXaafvqCGX9hJ4GnRx6Xcu930PwN5jEPWgx1y/gpWPFBJQkNKaVpt8d2Tdzgubl1g9zY0w5Sta4/XhyZKBwZpJsMl92bghvd+WGDu0+q/6od7SC9ZPFZEpZWuE42Voswhi0AB2v+BqY8vQ2fxZA1faN6VpZQddetPOVqqwvmcGiD4USlqBadJK6AE1pGbUcfQqnmY/clGW76ZXMzOHnPzTXfAO9S+q9PtRmBB7JvbkzORAjiYwcYy+2DEwfedue+gPhRCSp0kcANESJxTwG3NN2PrUQ31Ttc1Yce5GqukTmVTN+iLAeU8cfZD2YNa5Kh6dwRN2Ej96SX6SpHzS5P/kULoNxATSooUA2pOJseH2vLcPWZw3fu5NXPypJ9HOkm6owYUINgInh1li08O2bphQgwiHfqn3VINKjWYYde8FQXEm1PX1vzlHGbuukIA26Pjh+IVAm7PgLTUpCle09m2aFOvzcdPfYHCg5p//SFTjssrRqnXJEbfppBTKXh39JNquoXI+1Yavzk6rt4Lsq7va+WrAzNlAa5l5fAoyrcSHeZT1w2mK/KO8AaZvMTclgyVov4fsMgvnpO6eWGlJM8qjllHY268UslFurck9RFMlI1dbEabn5zfJkyHj+o297m5BxTmOlg/J2JBg5zwPAh2dIJklL7uHu5ENi/dXd8gHVS48VyP0TcWmhAHDJtwMlw6mPIZp7kgi69WgcAb1RYEWOY1OxclZgJxb9v/fDiLQvLXCjKlB/05oUEmy3ZoHU5ah8CoLr14UKyYWOFzJhQKz/whFinl5xvw8XCf3wsw8zKa6qj30Oc9UfQNDkQa/HaJZTric7Utvx1mgXzm8rNDDGC63WE/ZZoG/bP3fojwP6r4wmNb1D79cwNHybrmD8V3PjL shionichikawa@ShionnoMacBook-Pro.local"
        }
      + preserve_boot_volume                = true
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + security_attributes                 = (known after apply)
      + security_attributes_state           = (known after apply)
      + shape                               = "VM.Standard.A1.Flex"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config {
          + are_all_plugins_disabled = false
          + is_management_disabled   = false
          + is_monitoring_disabled   = false

          + plugins_config (known after apply)
        }

      + availability_config {
          + is_live_migration_preferred = true
          + recovery_action             = "RESTORE_INSTANCE"
        }

      + create_vnic_details {
          + assign_ipv6ip             = (known after apply)
          + assign_private_dns_record = true
          + assign_public_ip          = "true"
          + defined_tags              = (known after apply)
          + display_name              = "oci_compute_instance-k8s-proxy"
          + freeform_tags             = (known after apply)
          + hostname_label            = "instance-k8s-proxy"
          + nsg_ids                   = [
              + "ocid1.networksecuritygroup.oc1.ap-tokyo-1.aaaaaaaareo3ddfn7ljzuyyfungeuweyh2tdfn7b2ty3gvxqmx4ig5equobq",
            ]
          + private_ip                = "10.0.0.21"
          + security_attributes       = (known after apply)
          + skip_source_dest_check    = true
          + subnet_id                 = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaneghxjqpturxbnptzpcf44egzgd2gzg3el2oxyum2lj3ygczbkeq"
          + vlan_id                   = (known after apply)

          + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      + instance_options (known after apply)

      + launch_options {
          + boot_volume_type                    = "PARAVIRTUALIZED"
          + firmware                            = "UEFI_64"
          + is_consistent_volume_naming_enabled = true
          + is_pv_encryption_in_transit_enabled = (known after apply)
          + network_type                        = "PARAVIRTUALIZED"
          + remote_data_volume_type             = "PARAVIRTUALIZED"
        }

      + launch_volume_attachments (known after apply)

      + licensing_configs (known after apply)

      + placement_constraint_details (known after apply)

      + platform_config (known after apply)

      + preemptible_instance_config (known after apply)

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 6
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
          + vcpus                         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs         = "50"
          + boot_volume_vpus_per_gb         = "10"
          + is_preserve_boot_volume_enabled = false
          + source_id                       = "ocid1.image.oc1.ap-tokyo-1.aaaaaaaaewdrshfelq3fuqrzqtxszyqr3rctikgkzutr7uyiisatbfipfzsq"
          + source_type                     = "image"

          + instance_source_image_filter_details (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
module.oci_compute_instance-k8s-proxy.oci_core_instance.this: Creating...
╷
│ Error: 404-NotAuthorizedOrNotFound, Authorization failed or requested resource not found.
│ Suggestion: Either the resource has been deleted or service Core Instance need policy to access this resource. Policy reference: https://docs.oracle.com/en-us/iaas/Content/Identity/Reference/policyreference.htm
│ Documentation: https://registry.terraform.io/providers/oracle/oci/latest/docs/resources/core_instance 
│ API Reference: https://docs.oracle.com/iaas/api/#/en/iaas/20160918/Instance/LaunchInstance 
│ Request Target: POST https://iaas.ap-tokyo-1.oraclecloud.com/20160918/instances 
│ Provider version: 7.11.0, released on 2025-07-28. This provider is 13 Update(s) behind to current. 
│ Service: Core Instance 
│ Operation Name: LaunchInstance 
│ OPC request ID: d90d42d0cf02fe364a4ffb2a959b2a87/6A74D2A9CB9147E14F7601694E5254FB/2330DFB8AAA9157CC85FACAFB9DB8EBA 
│ 
│ 
│   with module.oci_compute_instance-k8s-proxy.oci_core_instance.this,
│   on ../../modules/main/compute/main.tf line 1, in resource "oci_core_instance" "this":
│    1: resource "oci_core_instance" "this" {
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terragrunt-apply","PRNumber":52,"Program":"tfcmt","SHA1":"b89089c813d0a9a0110714ce38a5683f57203b4e","Target":"main","Vars":{},"WorkflowName":"Run Apply on OCI"} -->